tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'codekitchen/dinghy'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/x11'
tap 'neovim/neovim'
tap 'rstacruz/backup'
tap 'sscotth/monoid'
cask 'java'
cask 'xquartz'
brew 'android-sdk'
brew 'pkg-config'
brew 'libyaml'
brew 'makedepend'
brew 'openssl', args: ['universal']
brew 'ansible'
brew 'xz'
brew 'libssh2'
brew 'aria2'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'libpng', args: ['universal']
brew 'freetype', args: ['universal']
brew 'fontconfig', args: ['universal']
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'gobject-introspection'
brew 'atk'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'aws-elasticbeanstalk'
brew 'awscli'
brew 'bdw-gc'
brew 'icu4c'
brew 'boost'
brew 'readline'
brew 'sqlite'
brew 'gdbm'
brew 'python3'
brew 'boost-python'
brew 'go'
brew 'boot2docker'
brew 'ghc'
brew 'cabal-install'
brew 'cabextract'
brew 'libtasn1', args: ['universal']
brew 'gmp'
brew 'nettle'
brew 'gnutls'
brew 'libtool', args: ['universal']
brew 'jpeg', args: ['universal']
brew 'libtiff', args: ['universal']
brew 'little-cms2', args: ['universal']
brew 'harfbuzz'
brew 'pango'
brew 'imagemagick'
brew 'emacs'
brew 'cask'
brew 'cmake'
brew 'mpfr'
brew 'cgal'
brew 'cheat'
brew 'chruby'
brew 'doxygen'
brew 'pcre2'
brew 'fish', args: ['HEAD']
brew 'chruby-fish', args: ['HEAD']
brew 'cloc'
brew 'cscope'
brew 'ctags'
brew 'libsodium'
brew 'zeromq'
brew 'czmq'
brew 'godep'
brew 'deis'
brew 'direnv'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'dnsmasq'
brew 'elinks'
brew 'wxmac'
brew 'erlang'
brew 'elixir'
brew 'emp'
brew 'entr'
brew 'expat'
brew 'faac'
brew 'texi2html'
brew 'python'
brew 'yasm'
brew 'x264'
brew 'lame'
brew 'xvid'
brew 'libogg'
brew 'libvorbis'
brew 'libvpx'
brew 'libcaca'
brew 'ffmpeg'
brew 'figlet'
brew 'giflib'
brew 'fontforge'
brew 'fpp'
brew 'freexl'
brew 'fzf'
brew 'gd', args: ['universal']
brew 'lzlib'
brew 'proj'
brew 'libgeotiff'
brew 'geos'
brew 'libxml2'
brew 'gpp'
brew 'json-c'
brew 'liblwgeom'
brew 'libspatialite'
brew 'postgresql', service_restart: true
brew 'mysql'
brew 'gdal'
brew 'gdk-pixbuf'
brew 'gifify'
brew 'git-cal'
brew 'git-extras'
brew 'git-fresh'
brew 'git-lfs'
brew 'github-release'
brew 'libepoxy'
brew 'hicolor-icon-theme'
brew 'gsettings-desktop-schemas'
brew 'jasper', args: ['universal']
brew 'gtk+3'
brew 'gnome-icon-theme'
brew 'gnu-getopt'
brew 'gnu-sed', args: ['with-default-names']
brew 'libusb', args: ['universal']
brew 'libusb-compat', args: ['universal']
brew 'gnupg'
brew 'pinentry'
brew 'gpg-agent'
brew 'gnupg2'
brew 'graphicsmagick'
brew 'gtksourceview3'
brew 'haskell-stack'
brew 'ruby'
brew 'heroku'
brew 'hledger'
brew 'htop-osx'
brew 'httperf'
brew 'httpie'
brew 'hub'
brew 'jmeter'
brew 'oniguruma'
brew 'jq'
brew 'jsonpp'
brew 'ledger'
brew 'libevent'
brew 'libgphoto2', args: ['universal']
brew 'libicns', args: ['universal']
brew 'libsass'
brew 'libvo-aacenc'
brew 'links'
brew 'lua'
brew 'luajit'
brew 'lynx'
brew 'mackup'
brew 'macvim', args: ['with-lua', 'with-override-system-vim', 'with-python3']
brew 'md5sha1sum'
brew 'mercurial'
brew 'mr'
brew 'ninja'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'optipng'
brew 'ossp-uuid'
brew 'p7zip'
brew 'pandoc'
brew 'pwgen'
brew 'tree'
brew 'pass'
brew 'phantomjs'
brew 'prettyping'
brew 'py2cairo'
brew 'pygobject3'
brew 'qt'
brew 'ranger'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby-build'
brew 'ruby-install'
brew 'rust'
brew 's3cmd'
brew 'sane-backends', args: ['universal']
brew 'sdl2'
brew 'sfcgal'
brew 'siege'
brew 'sift'
brew 'sl'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'subliminal'
brew 'task'
brew 'terminal-notifier'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'toilet'
brew 'unfs3'
brew 'unixodbc'
brew 'unrar'
brew 'v8'
brew 'vit'
brew 'w3m'
brew 'watchman'
brew 'wget'
brew 'wine'
brew 'winetricks'
brew 'wrk'
brew 'youtube-dl'
brew 'zsh'
brew 'homebrew/boneyard/ngrok'
brew 'homebrew/versions/gmp4'
brew 'homebrew/versions/phantomjs192'
brew 'neovim/neovim/neovim', args: ['HEAD']
cask 'adobe-creative-cloud'
cask 'airserver'
cask 'alfred'
cask 'alternote'
cask 'android-file-transfer'
cask 'android-studio'
cask 'appcleaner'
cask 'awareness'
cask 'bartender'
cask 'battle-net'
cask 'bettertouchtool'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'cathode'
cask 'coconutbattery'
cask 'colloquy'
cask 'colorpicker-hex'
cask 'crashplan'
cask 'cyberduck'
cask 'dropbox'
cask 'evernote'
cask 'fantastical'
cask 'firefox'
cask 'flash-player'
cask 'fluid'
cask 'flux'
cask 'font-anonymous-pro-for-powerline'
cask 'font-arimo'
cask 'font-baron'
cask 'font-bebas-neue'
cask 'font-bitter'
cask 'font-clear-sans'
cask 'font-cousine'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-envy-code-r'
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-hermit'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-input'
cask 'font-jaapokki'
cask 'font-karla'
cask 'font-league-gothic'
cask 'font-league-script'
cask 'font-liberation-mono-for-powerline'
cask 'font-merriweather'
cask 'font-meslo-lg-for-powerline'
cask 'font-monoid'
cask 'font-montserrat'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-rokkitt'
cask 'font-sauce-code-powerline'
cask 'font-sinkin-sans'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-terminus'
cask 'font-ubuntu'
cask 'font-ubuntu-mono-powerline'
cask 'font-work-sans'
cask 'gimp'
cask 'gitter'
cask 'glyphs'
cask 'google-chrome'
cask 'google-drive'
cask 'gyazo'
cask 'helium'
cask 'iconping'
cask 'isolator'
cask 'iterm2'
cask 'karabiner'
cask 'keepingyouawake'
cask 'keyboard-cleaner'
cask 'libreoffice'
cask 'licecap'
cask 'logitech-control-center'
cask 'macdown'
cask 'noizio'
cask 'nosleep'
cask 'numi'
cask 'nylas-n1'
cask 'openemu'
cask 'origami'
cask 'pingmenu'
cask 'reaper'
cask 'screenflow'
cask 'screenhero'
cask 'sketch'
cask 'sketch-toolbox'
cask 'skitch'
cask 'skyfonts'
cask 'skype'
cask 'slack'
cask 'smoothmouse'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'techstoreclub-simple-comic'
cask 'transmission'
cask 'unsplash-wallpaper'
cask 'viber'
cask 'virtualbox'
cask 'vlc'
