# Brew starter kit!
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/services'
tap 'd12frosted/emacs-plus'

brew 'autojump' # jumps to folders via 'j keyword'
brew 'd12frosted/emacs-plus/emacs-plus', args: ['devel']
brew 'fish' # friendly interactive shell
brew 'git' # something programmers use, I guess
brew 'git-extras' # convenient git commands
brew 'htop' # activity monitor
brew 'kpcli' # keepass cli client
brew 'ranger' # finder for cli
brew 'ripgrep' # find fast via 'rg'
brew 'terminal-notifier' # cli notification sender
brew 'tig' # git client
brew 'tmux' # terminal screen manager

# Cask
# cask 'alfred'
cask 'app-tamer' # cpu limiter
cask 'caskroom/versions/firefox-developer-edition' # future firefox
cask 'google-backup-and-sync' # sync files with google drive
cask 'google-chrome'
cask 'karabiner-elements' # config keyboard keys
cask 'keeweb' # keepass client
cask 'keyboardcleantool' # disables keyboard for cleaning
cask 'kitty' # terminal emulator
cask 'resilio-sync' # sync files over the network
cask 'skitch' # image paste tool
cask 'spectacle' # move keywords via keys

# Fonts
cask 'caskroom/fonts/font-iosevka'
cask 'caskroom/fonts/font-iosevka-nerd-font'
cask 'caskroom/fonts/font-roboto'
