tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'd12frosted/emacs-plus'
tap 'heroku/brew'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/x11'
tap 'jmacdonald/amp'
tap 'rstacruz/backup'
tap 'universal-ctags/universal-ctags'
# brew 'libyaml' # dependents: ansible, ruby
# brew 'readline' # dependents: gnupg, postgresql, python, ruby, tig, v8
# brew 'python' # dependents: ansible, aws-elasticbeanstalk, fontforge, graphviz, gsettings-desktop-schemas, libepoxy, mackup, macvim, neovim, postgresql, s3cmd, sphinx-doc, subliminal, v8, watchman
brew 'ansible'
brew 'aria2'
# brew 'gettext' # dependents: coreutils, fontforge, git, gnu-getopt, gnupg, gsettings-desktop-schemas, libgphoto2, neovim, texi2html, utimer, wget, yasm
# brew 'atk' # dependents: gtk+3
# brew 'autoconf' # dependents: coreutils, ctags, emacs, emacs-plus, erlang, fish, gd, ghc, ghostscript, global, graphviz, hicolor-icon-theme, htop, jq, libcaca, libgphoto2, libogg, libsodium, libvorbis, mosh, postgis, ruby, ruby-build, sshfs, the_silver_searcher, tig, tmate, tmux, watchman, wget, yasm, zeromq, zsh
brew 'autojump'
brew 'aws-elasticbeanstalk'
brew 'awscli'
# brew 'ghc' # dependents: cabal-install, hledger, pandoc
# brew 'cabal-install' # dependents: hledger, pandoc
# brew 'cabextract' # dependents: winetricks
# brew 'chruby' # dependents: chruby-fish
# brew 'fish' # dependents: chruby-fish
brew 'chruby-fish', args: ['HEAD']
brew 'cloc'
brew 'coreutils'
brew 'cpulimit'
brew 'cputhrottle'
# brew 'cscope' # dependents: macvim
# brew 'ctags', link: false # dependents: global
brew 'direnv'
# brew 'libassuan' # dependents: dirmngr, gnupg, gpg-agent
# brew 'libksba' # dependents: dirmngr, gnupg, gpg-agent
# brew 'pth' # dependents: dirmngr, gpg-agent
brew 'dirmngr', link: true
brew 'doctl'
brew 'elasticsearch'
# brew 'wxmac' # dependents: erlang
# brew 'erlang' # dependents: elixir
brew 'elixir'
brew 'emacs', link: false
brew 'entr'
brew 'faac'
brew 'fasd'
brew 'fd'
# brew 'lame' # dependents: ffmpeg
# brew 'x264' # dependents: ffmpeg
# brew 'xvid' # dependents: ffmpeg
brew 'ffmpeg'
brew 'figlet'
# brew 'libtool', args: ['universal'] # dependents: erlang, fontforge, gd, ghc, ghostscript, global, graphicsmagick, graphviz, htop, imagemagick, jq, libcaca, libgphoto2, libogg, libsodium, libvorbis, postgis, sshfs, tmate, tmux, watchman, zeromq
brew 'fontforge'
# brew 'fop' # dependents: erlang
brew 'fzf'
# brew 'gd', args: ['universal'] # dependents: graphviz, libgphoto2
brew 'geth'
# brew 'ghostscript' # dependents: graphicsmagick, imagemagick
brew 'git'
brew 'git-cal'
brew 'git-extras'
brew 'git-fresh'
brew 'git-lfs'
brew 'github-release'
brew 'global'
# brew 'gnu-getopt' # dependents: pass
# brew 'gnupg' # dependents: pass
# brew 'go' # dependents: direnv, doctl, fzf, geth, git, git-lfs, github-release, godep, hub, terraform
brew 'godep'
brew 'gpg-agent', link: true
# brew 'jasper', args: ['universal'] # dependents: graphicsmagick, gtk+3, libicns
brew 'graphicsmagick'
# brew 'graphviz' # dependents: postgis
# brew 'gsettings-desktop-schemas' # dependents: gtk+3
# brew 'hicolor-icon-theme' # dependents: gtk+3
# brew 'libepoxy' # dependents: gtk+3
brew 'gtk+3'
# brew 'lua' # dependents: highlight, macvim
brew 'highlight'
brew 'hledger'
brew 'htop'
brew 'httpie'
brew 'hub'
# brew 'imagemagick' # dependents: postgis
# brew 'oniguruma' # dependents: jq
brew 'jq'
brew 'jsonpp'
# brew 'libcaca' # dependents: ffmpeg, toilet
# brew 'libusb-compat', args: ['universal'] # dependents: libgphoto2
brew 'libgphoto2', args: ['universal']
brew 'libicns', args: ['universal']
# brew 'libogg' # dependents: libvorbis
# brew 'libsodium' # dependents: zeromq
# brew 'libvorbis' # dependents: ffmpeg
# brew 'libvpx' # dependents: ffmpeg
brew 'lsusb'
# brew 'luajit' # dependents: macvim, neovim
brew 'lzlib'
brew 'mackup'
brew 'macvim', args: ['with-lua', 'with-override-system-vim', 'with-python3']
# brew 'makedepend' # dependents: wine
brew 'md5sha1sum'
brew 'mosh'
brew 'mysql'
brew 'neovim'
brew 'neovim-dot-app'
brew 'nvm'
brew 'optipng'
# brew 'p7zip' # dependents: winetricks
# brew 'pandoc' # dependents: youtube-dl
# brew 'tree' # dependents: pass
brew 'pass'
brew 'phantomjs'
brew 'pinentry-mac'
# brew 'postgresql', restart_service: true # dependents: postgis
brew 'postgis'
brew 'pwgen'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'ripgrep'
# brew 'ruby', link: false # dependents: graphviz
brew 'ruby-build'
# brew 'rust' # dependents: amp, fd, ripgrep, watchexec
brew 's3cmd'
# brew 'sphinx-doc' # dependents: ghc, python
brew 'ssh-copy-id'
brew 'sshfs'
brew 'subliminal'
brew 'terminal-notifier'
brew 'terraform', link: false
# brew 'texi2html' # dependents: ffmpeg
brew 'the_silver_searcher'
brew 'tig'
brew 'tmate'
# brew 'tmux' # dependents: mosh
brew 'toilet'
# brew 'unrar' # dependents: winetricks
brew 'utimer'
brew 'v8'
brew 'w3m'
brew 'watchexec'
brew 'watchman'
# brew 'wget' # dependents: coreutils
# brew 'wine' # dependents: winetricks
brew 'winetricks'
brew 'yarn'
# brew 'yasm' # dependents: libvpx
brew 'youtube-dl'
# brew 'zeromq' # dependents: ffmpeg
brew 'zsh'
brew 'd12frosted/emacs-plus/emacs-plus', args: ['devel']
brew 'heroku/brew/heroku'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
# brew 'cmake' # dependents: amp, jasper, mysql, neovim, rust, wine
# brew 'openssl' # dependents: amp, ansible, erlang, ffmpeg, git, md5sha1sum, mysql, phantomjs, postgresql, python, ruby, ruby-build, rust, w3m, watchman, wget
# brew 'pkg-config' # dependents: ansible, aria2, atk, emacs, emacs-plus, ffmpeg, fontforge, ghostscript, gnupg, graphicsmagick, graphviz, gsettings-desktop-schemas, gtk+3, highlight, htop, imagemagick, libcaca, libepoxy, libgphoto2, libusb-compat, libvorbis, makedepend, mosh, neovim, postgis, python, ruby, ruby-build, rust, sshfs, the_silver_searcher, tmate, tmux, toilet, utimer, w3m, watchman, wget, wine, zeromq
# brew 'libssh2' # dependents: aria2, rust
# brew 'glib' # dependents: atk, gsettings-desktop-schemas, gtk+3, sshfs, utimer
# brew 'gobject-introspection' # dependents: atk, gsettings-desktop-schemas, gtk+3
# brew 'python3' # dependents: awscli, ghc, httpie, macvim, postgresql
# brew 'automake' # dependents: coreutils, erlang, fish, gd, ghc, ghostscript, global, graphviz, hicolor-icon-theme, htop, jq, libcaca, libgphoto2, libogg, libsodium, libvorbis, mosh, postgis, sshfs, the_silver_searcher, tig, tmate, tmux, watchman, wget, yasm, zeromq
# brew 'bison' # dependents: coreutils, global
# brew 'gmp' # dependents: coreutils
# brew 'texinfo' # dependents: coreutils, emacs, emacs-plus
# brew 'xz' # dependents: coreutils, ffmpeg, imagemagick, the_silver_searcher, wget
# brew 'libgcrypt' # dependents: dirmngr, gnupg, gpg-agent
# brew 'libgpg-error' # dependents: dirmngr, gnupg, gpg-agent, libassuan, libksba
# brew 'gradle' # dependents: elasticsearch
# brew 'dbus' # dependents: emacs, emacs-plus
# brew 'gnu-sed' # dependents: emacs, emacs-plus
# brew 'gnutls' # dependents: emacs, emacs-plus, gnupg
# brew 'imagemagick@6' # dependents: emacs, emacs-plus
# brew 'librsvg' # dependents: emacs, emacs-plus, ffmpeg, graphviz, imagemagick
# brew 'mailutils' # dependents: emacs, emacs-plus
# brew 'fontconfig' # dependents: emacs-plus, ffmpeg, fontforge, gd, imagemagick
# brew 'freetype' # dependents: emacs-plus, ffmpeg, gd, graphicsmagick, graphviz, imagemagick
# brew 'mercurial' # dependents: entr
# brew 'chromaprint' # dependents: ffmpeg
# brew 'fdk-aac' # dependents: ffmpeg
# brew 'frei0r' # dependents: ffmpeg
# brew 'game-music-emu' # dependents: ffmpeg
# brew 'libass' # dependents: ffmpeg
# brew 'libbluray' # dependents: ffmpeg
# brew 'libbs2b' # dependents: ffmpeg
# brew 'libgsm' # dependents: ffmpeg
# brew 'libmodplug' # dependents: ffmpeg
# brew 'libsoxr' # dependents: ffmpeg
# brew 'libssh' # dependents: ffmpeg, tmate
# brew 'libvidstab' # dependents: ffmpeg
# brew 'nasm' # dependents: ffmpeg, x264
# brew 'opencore-amr' # dependents: ffmpeg
# brew 'openh264' # dependents: ffmpeg
# brew 'openjpeg' # dependents: ffmpeg, imagemagick
# brew 'opus' # dependents: ffmpeg
# brew 'rtmpdump' # dependents: ffmpeg
# brew 'rubberband' # dependents: ffmpeg
# brew 'sdl2' # dependents: ffmpeg
# brew 'snappy' # dependents: ffmpeg
# brew 'speex' # dependents: ffmpeg
# brew 'tesseract' # dependents: ffmpeg
# brew 'theora' # dependents: ffmpeg
# brew 'two-lame' # dependents: ffmpeg
# brew 'wavpack' # dependents: ffmpeg
# brew 'webp' # dependents: ffmpeg, gd, graphicsmagick, imagemagick
# brew 'x265' # dependents: ffmpeg
# brew 'zimg' # dependents: ffmpeg
# brew 'doxygen' # dependents: fish, postgis
# brew 'pcre2' # dependents: fish, git
# brew 'cairo' # dependents: fontforge
# brew 'giflib' # dependents: fontforge
# brew 'jpeg' # dependents: fontforge, gd, graphicsmagick, imagemagick, jasper, wxmac
# brew 'libpng' # dependents: fontforge, gd, graphicsmagick, graphviz, imagemagick, libicns, wxmac
# brew 'libspiro' # dependents: fontforge
# brew 'libtiff' # dependents: fontforge, gd, graphicsmagick, imagemagick, wxmac
# brew 'libuninameslist' # dependents: fontforge
# brew 'pango' # dependents: fontforge, graphviz, gtk+3, imagemagick
# brew 'glide' # dependents: fzf
# brew 'libxml2' # dependents: gettext
# brew 'little-cms2' # dependents: ghostscript, graphicsmagick, imagemagick
# brew 'curl' # dependents: git
# brew 'perl' # dependents: git, imagemagick
# brew 'subversion' # dependents: git
# brew 'flex' # dependents: global
# brew 'adns' # dependents: gnupg
# brew 'encfs' # dependents: gnupg
# brew 'libusb' # dependents: gnupg, libusb-compat
# brew 'npth' # dependents: gnupg
# brew 'pinentry' # dependents: gnupg, gpg-agent
# brew 'sqlite' # dependents: gnupg, python
# brew 'libwmf' # dependents: graphicsmagick, imagemagick
# brew 'gts' # dependents: graphviz
# brew 'swig' # dependents: graphviz
# brew 'intltool' # dependents: gsettings-desktop-schemas, utimer
# brew 'libffi' # dependents: gsettings-desktop-schemas
# brew 'gdk-pixbuf' # dependents: gtk+3
# brew 'heroku/brew/heroku-node' # dependents: heroku
# brew 'boost' # dependents: highlight
# brew 'ncurses' # dependents: htop
# brew 'fftw' # dependents: imagemagick
# brew 'gcc' # dependents: imagemagick
# brew 'liblqr' # dependents: imagemagick
# brew 'little-cms' # dependents: imagemagick
# brew 'openexr' # dependents: imagemagick
# brew 'imlib2' # dependents: libcaca
# brew 'meson' # dependents: libepoxy
# brew 'ninja' # dependents: libepoxy
# brew 'libexif' # dependents: libgphoto2
# brew 'protobuf' # dependents: mosh
# brew 'jemalloc' # dependents: neovim
# brew 'libtermkey' # dependents: neovim
# brew 'libuv' # dependents: neovim
# brew 'libvterm' # dependents: neovim
# brew 'lua@5.1' # dependents: neovim
# brew 'msgpack' # dependents: neovim, tmate
# brew 'unibilium' # dependents: neovim
# brew 'qrencode' # dependents: pass
# brew 'docbook-xsl' # dependents: postgis, ripgrep
# brew 'gdal' # dependents: postgis
# brew 'geos' # dependents: postgis
# brew 'gpp' # dependents: postgis
# brew 'gtk+' # dependents: postgis
# brew 'json-c' # dependents: postgis
# brew 'pcre' # dependents: postgis, the_silver_searcher, watchman, wget, zsh
# brew 'proj' # dependents: postgis
# brew 'protobuf-c' # dependents: postgis
# brew 'sfcgal' # dependents: postgis
# brew 'berkeley-db@4' # dependents: python
# brew 'gdbm' # dependents: python, zsh
# brew 'tcl-tk' # dependents: python
# brew 'asciidoc' # dependents: ripgrep, tig, zeromq
# brew 'llvm' # dependents: rust
# brew 'gox' # dependents: terraform
# brew 'xmlto' # dependents: tig, zeromq
# brew 'libevent' # dependents: tmate, tmux
# brew 'utf8proc' # dependents: tmux
# brew 'bdw-gc' # dependents: w3m
# brew 'gpgme' # dependents: wget
# brew 'libidn2' # dependents: wget
# brew 'libmetalink' # dependents: wget
# brew 'pod2man' # dependents: wget
# brew 'zenity' # dependents: winetricks
# brew 'l-smash' # dependents: x264
# brew 'node' # dependents: yarn
# brew 'cython' # dependents: yasm
# brew 'libpgm' # dependents: zeromq
# brew 'norm' # dependents: zeromq
cask 'java'
cask 'osxfuse'
cask 'xquartz'
cask 'adobe-acrobat-reader'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'android-studio'
cask 'app-tamer'
cask 'appcleaner'
cask 'appzapper'
cask 'atom'
cask 'awareness'
cask 'bartender'
cask 'bitbar'
cask 'ccleaner'
cask 'clamxav'
cask 'coconutbattery'
cask 'crashplan'
cask 'cumulus'
cask 'cyberduck'
cask 'discord'
cask 'diskwave'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'figma'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'fluid'
cask 'flux'
cask 'font-meslo-lg-for-powerline'
cask 'fontbase'
cask 'gitter'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'insync'
cask 'iterm2'
cask 'keepassxc'
cask 'keepingyouawake'
cask 'keeweb'
cask 'keybase'
cask 'keyboardcleantool'
cask 'kitty'
cask 'launchbar'
cask 'licecap'
cask 'macdown'
cask 'macpass'
cask 'noizio'
cask 'nosleep'
cask 'nvalt'
cask 'nylas-mail'
cask 'p4merge'
cask 'paparazzi'
cask 'pocket-casts'
cask 'psequel'
cask 'rescuetime'
cask 'screenflow'
cask 'secure-pipes'
cask 'sketch-toolbox'
cask 'skitch'
cask 'skyfonts'
cask 'skype'
cask 'slack'
cask 'smoothmouse'
cask 'soundcleod'
cask 'spectacle'
cask 'spotify'
cask 'station'
cask 'steam'
cask 'thyme'
cask 'transmission'
cask 'tunnelblick'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vanilla'
cask 'viber'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'vox'
cask 'webcatalog'
cask 'ynab'
cask 'zeplin'
cask 'caskroom/fonts/font-arimo'
cask 'caskroom/fonts/font-baron'
cask 'caskroom/fonts/font-bebas-neue'
cask 'caskroom/fonts/font-bitter'
cask 'caskroom/fonts/font-clear-sans'
cask 'caskroom/fonts/font-cousine'
cask 'caskroom/fonts/font-dejavu-sans-mono-for-powerline'
cask 'caskroom/fonts/font-droid-sans-mono-for-powerline'
cask 'caskroom/fonts/font-envy-code-r'
cask 'caskroom/fonts/font-fira-code'
cask 'caskroom/fonts/font-fira-mono-for-powerline'
cask 'caskroom/fonts/font-fira-sans'
cask 'caskroom/fonts/font-hack'
cask 'caskroom/fonts/font-hermit'
cask 'caskroom/fonts/font-inconsolata-dz-for-powerline'
cask 'caskroom/fonts/font-inconsolata-for-powerline'
cask 'caskroom/fonts/font-inconsolata-g-for-powerline'
cask 'caskroom/fonts/font-input'
cask 'caskroom/fonts/font-iosevka'
cask 'caskroom/fonts/font-jaapokki'
cask 'caskroom/fonts/font-karla'
cask 'caskroom/fonts/font-league-gothic'
cask 'caskroom/fonts/font-league-script'
cask 'caskroom/fonts/font-liberation-mono-for-powerline'
cask 'caskroom/fonts/font-merriweather'
cask 'caskroom/fonts/font-monoid'
cask 'caskroom/fonts/font-montserrat'
cask 'caskroom/fonts/font-open-sans'
cask 'caskroom/fonts/font-open-sans-condensed'
cask 'caskroom/fonts/font-raleway'
cask 'caskroom/fonts/font-roboto'
cask 'caskroom/fonts/font-rokkitt'
cask 'caskroom/fonts/font-sinkin-sans'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-source-code-pro-for-powerline'
cask 'caskroom/fonts/font-source-sans-pro'
cask 'caskroom/fonts/font-source-serif-pro'
cask 'caskroom/fonts/font-terminus'
cask 'caskroom/fonts/font-ubuntu'
cask 'caskroom/fonts/font-work-sans'
cask 'caskroom/versions/atom-beta'
